Revit 2024 API
SolidCurveIntersection.SegmentCount Property
 The number of segments in the results.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int SegmentCount { get; }
Visual Basic
Public ReadOnly Property SegmentCount As Integer
	Get
Visual C++
public:
property int SegmentCount {
	int get ();
}
See Also
SolidCurveIntersection Class
Autodesk.Revit.DB Namespace